Revit 2024 API
ComboBoxMemberData Properties
The ComboBoxMemberData type exposes the following members.
Properties
Name | Description
GroupName
Gets or sets a group name for the ComboBoxMember.
Image
The image shown on the ComboBoxMember.
LongDescription
 Long description of the command tooltip
 (Inherited from RibbonItemData.)
Name
The name of the item.
 (Inherited from RibbonItemData.)
Text
The user-visible text of the ComboBoxMember.
ToolTip
The description that appears as a ToolTip for the item.
 (Inherited from RibbonItemData.)
ToolTipImage
The image to show as a part of the button extended tooltip
 (Inherited from RibbonItemData.)
See Also
ComboBoxMemberData Class
Autodesk.Revit.UI Namespace